In [84]:
import mysql.connector
from mysql.connector import Error
def server_connection(host_name,user_name,user_password,db_name):
    connection=None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            password=user_password,
            db=db_name
        )
        print("mysql database connection successful")
        print(f"connected to {db_name} database")
    except Error as err:
        print(f"Error :",err)
    return connection

In [85]:
connection = server_connection("localhost","root","Subbu@2003","practice")

mysql database connection successful
connected to practice database

In [86]:
def execute_query(connection,query):
   res=None
   try:
     cursor=connection.cursor()
     if query.strip().upper().startswith("SELECT"):
      cursor.execute(query)
      print("Query Successful")
      res=cursor.fetchall()
      for i in res:
        print(i)
     else:
       cursor.execute(query)
       connection.commit()
       print("Query Successful")
   except Error as e:
      print(e)
   finally:
      if 'cursor' in locals() and cursor:
        cursor.close()
   return res

In [87]:
results=execute_query(connection,"SELECT emp_no,ename,salary , RANK() OVER(ORDER BY SALARY DESC) AS RANK_EMP FROM EMP")

Query Successful
(7839, 'KING', 5000, 1)
(7782, 'SCOTT', 4050, 2)
(7788, 'SCOTT', 4050, 2)
(7902, 'FORD', 4050, 2)
(7566, 'JONES', 4014, 5)
(7698, 'BLAKE', 2850, 6)
(7934, 'MILLER', 2000, 7)
(7369, 'SMITH', 1755, 8)
(7499, 'ALLEN', 1600, 9)
(7844, 'TURNER', 1500, 10)
(7876, 'ADAMS', 1485, 11)
(7521, 'WARD', 1250, 12)
(7654, 'MARTIN', 1250, 12)
(7900, 'JAMES', 950, 14)

In [88]:
print(results)

[(7839, 'KING', 5000, 1), (7782, 'SCOTT', 4050, 2), (7788, 'SCOTT', 4050, 2), (7902, 'FORD', 4050, 2), (7566, 'JONES', 4014, 5), (7698, 'BLAKE', 2850, 6), (7934, 'MILLER', 2000, 7), (7369, 'SMITH', 1755, 8), (7499, 'ALLEN', 1600, 9), (7844, 'TURNER', 1500, 10), (7876, 'ADAMS', 1485, 11), (7521, 'WARD', 1250, 12), (7654, 'MARTIN', 1250, 12), (7900, 'JAMES', 950, 14)]

In [89]:
import pandas as pd

columns=["employee_no","employee_name","employee_salary","employee_rank"]
df=pd.DataFrame(results,columns=columns)
df.head()

   employee_no employee_name  employee_salary  employee_rank
0         7839          KING             5000              1
1         7782         SCOTT             4050              2
2         7788         SCOTT             4050              2
3         7902          FORD             4050              2
4         7566         JONES             4014              5

In [90]:
execute_query(connection,"insert into dept values(70,'Analyst','chennai')")

1062 (23000): Duplicate entry '70' for key 'dept.PRIMARY'

In [91]:
execute_query(connection,"delete from dept where dept_no in (50,60,70)")

Query Successful

In [92]:
dept_results=execute_query(connection,"select * from dept")

Query Successful
(10, 'ACOUNTION', 'HYDERABAD')
(20, 'SALES', 'LANDON')
(30, 'OPERATIONS', 'ANDHRA')
(40, 'HR', 'MUMBAI')

In [93]:

columns=["dept_no","dept_name","location"]
df=pd.DataFrame(dept_results,columns=columns)
df.head()

   dept_no   dept_name   location
0       10   ACOUNTION  HYDERABAD
1       20       SALES     LANDON
2       30  OPERATIONS     ANDHRA
3       40          HR     MUMBAI